const preInspection = [

    {
        title:"ΚΑΘΑΡΙΣΜΟΣ",
        code:"1",
        paragraphs:[
            {
                title:"Εσωτερικά μέρη μηχανήματος, φίλτρα",
                code:"1.1",
                paragraphs:[]
            },
            {
                title:"Εξωτερικές επιφάνειες μηχανήματος",
                code:"1.2",
                paragraphs:[]
            }
        ]
    },
    {
        title:"ΕΞΑΡΤΗΜΑΤΑ ΜΕΤΑΔΟΣΗΣ ΙΣΧΥΟΣ",
        code:"2",
        paragraphs:[{
            title:"Ύπαρξη, συναρμογή, κατάσταση προφυλακτήρα άξονα δυναμοδότη (P.T.O.) και προφυλακτήρα δυναμολήπτη (P.I.C.)",
            code:"2.1",
            paragraphs:[]
        },{
            title:"Φθορές στα εξαρτήματα άξονα, συνδέσμους, συστήματα ασφάλισης",
            code:"2.2",
            paragraphs:[]
        },{
            title:"Λειτουργία, φθορές προφυλακτήρα άξονα μετάδοσης ισχύος",
            code:"2.3",
            paragraphs:[]
        },{
            title:"Ύπαρξη διάταξης ανάσχεσης περιστροφής προφυλακτήρα άξονα μετάδοσης ισχύος",
            code:"2.4",
            paragraphs:[]
        }]
    },
    {
        title:"ΚΙΝΟΥΜΕΝΑ ΜΕΡΗ",
        code:"3",
        paragraphs:[{
            title:"Ύπαρξη, λειτουργία προβλεπόμενων προφυλακτήρων για προστασία του χειριστή",
            code:"3.1",
            paragraphs:[]
        }]
    },
    {
        title:"ΣΩΛΗΝΕΣ ΚΑΙ ΕΥΚΑΜΠΤΟΙ ΣΩΛΗΝΕΣ ΥΔΡΑΥΛΙΚΗΣ ΜΕΤΑΔΟΣΗΣ",
        code:"4",
        paragraphs:[{
            title:"Διαρροή υδραυλικού συστήματος",
            code:"4.1",
            paragraphs:[]
        },{
            title:"Κάμψη, τριβή με τις περιβάλλουσες επιφάνειες, φθορά εύκαμπτων σωλήνων",
            code:"4.2",
            paragraphs:[]
        },{
            title:"Συγκράτηση, διάβρωση, φθορά σωλήνων",
            code:"4.3",
            paragraphs:[]
        }]
    },
    {
        title:"ΔΟΜΙΚΑ ΜΕΡΗ / ΠΛΑΙΣΙΟ",
        code:"5",
        paragraphs:[{
            title:"Παραμόρφωση, διάβρωση, φθορές δομικών μερών και πλαισίου",
            code:"5.1",
            paragraphs:[]
        }]
    },
    {
        title:"ΑΝΑΔΙΠΛΟΥΜΕΝΑ ΤΜΗΜΑΤΑ",
        code:"6",
        paragraphs:[{
            title:"Ασφάλιση πτυσσόμενων τμημάτων ψεκαστήρα στις προβλεπόμενες θέσεις",
            code:"6.1",
            paragraphs:[]
        }]
    },
    {
        title:"ΑΝΕΜΙΣΤΗΡΑΣ",
        code:"7",
        paragraphs:[{
            title:"Φθορές στον ανεμιστήρα (πτερωτή, περίβλημα, εκτροπείς αέρα)",
            code:"7.1",
            paragraphs:[]
        },{
            title:"Λειτουργικότητα, παραμόρφωση, τριβές, κραδασμοί",
            code:"7.2",
            paragraphs:[]
        },{
            title:"Ύπαρξη προφυλακτήρα",
            code:"7.3",
            paragraphs:[]
        },{
            title:"Απενεργοποίηση / Λειτουργία συμπλέκτη",
            code:"7.4",
            paragraphs:[]
        }]
    }
]

export default preInspection